
#### Directory: 'azuread-users-groups-roles'
#### Terraform Version Check 🔖`success` (2)
<details><summary>Show Version Check</summary>

```diff

[0m[0m
```

</details>

#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success` (2)

<details><summary>Show Plan</summary>

```diff

[command]/home/runner/work/_temp/11ba1ffd-d081-4493-8809-7b787378a1c3/terraform-bin show -no-color plan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_resource_group.artgroup will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "artgroup" {
+       id       = (known after apply)
+       location = (known after apply)
+       name     = "artgroup"
+       tags     = (known after apply)
    }

  # azuread_conditional_access_policy.Art_access_policy will be created
+   resource "azuread_conditional_access_policy" "Art_access_policy" {
+       display_name = "Art policy"
+       id           = (known after apply)
+       state        = "enabled"

+       conditions {
+           client_app_types = [
+               "all",
            ]

+           applications {
+               excluded_applications = []
+               included_applications = [
+                   "All",
                ]
            }

+           users {
+               included_groups = (known after apply)
            }
        }

+       grant_controls {
+           built_in_controls = [
+               "mfa",
            ]
+           operator          = "OR"
        }
    }

  # azuread_group.Art will be created
+   resource "azuread_group" "Art" {
+       auto_subscribe_new_members     = (known after apply)
+       display_name                   = "Art"
+       external_senders_allowed       = (known after apply)
+       hide_from_address_lists        = (known after apply)
+       hide_from_outlook_clients      = (known after apply)
+       id                             = (known after apply)
+       mail                           = (known after apply)
+       mail_nickname                  = (known after apply)
+       members                        = (known after apply)
+       object_id                      = (known after apply)
+       onpremises_domain_name         = (known after apply)
+       onpremises_netbios_name        = (known after apply)
+       onpremises_sam_account_name    = (known after apply)
+       onpremises_security_identifier = (known after apply)
+       onpremises_sync_enabled        = (known after apply)
+       owners                         = (known after apply)
+       preferred_language             = (known after apply)
+       prevent_duplicate_names        = false
+       proxy_addresses                = (known after apply)
+       security_enabled               = true
+       types                          = [
+           "DynamicMembership",
        ]
+       visibility                     = (known after apply)

+       dynamic_membership {
+           enabled = true
+           rule    = "user.department -eq "Art""
        }
    }

  # azuread_group.Engineering will be created
+   resource "azuread_group" "Engineering" {
+       auto_subscribe_new_members     = (known after apply)
+       display_name                   = "Engineering"
+       external_senders_allowed       = (known after apply)
+       hide_from_address_lists        = (known after apply)
+       hide_from_outlook_clients      = (known after apply)
+       id                             = (known after apply)
+       mail                           = (known after apply)
+       mail_nickname                  = (known after apply)
+       members                        = (known after apply)
+       object_id                      = (known after apply)
+       onpremises_domain_name         = (known after apply)
+       onpremises_netbios_name        = (known after apply)
+       onpremises_sam_account_name    = (known after apply)
+       onpremises_security_identifier = (known after apply)
+       onpremises_sync_enabled        = (known after apply)
+       owners                         = (known after apply)
+       preferred_language             = (known after apply)
+       prevent_duplicate_names        = false
+       proxy_addresses                = (known after apply)
+       security_enabled               = true
+       types                          = [
+           "DynamicMembership",
        ]
+       visibility                     = (known after apply)

+       dynamic_membership {
+           enabled = true
+           rule    = "user.department -eq "Engineering""
        }
    }

  # azuread_group.Readers will be created
+   resource "azuread_group" "Readers" {
+       auto_subscribe_new_members     = (known after apply)
+       display_name                   = "Readers"
+       external_senders_allowed       = (known after apply)
+       hide_from_address_lists        = (known after apply)
+       hide_from_outlook_clients      = (known after apply)
+       id                             = (known after apply)
+       mail                           = (known after apply)
+       mail_nickname                  = (known after apply)
+       members                        = (known after apply)
+       object_id                      = (known after apply)
+       onpremises_domain_name         = (known after apply)
+       onpremises_netbios_name        = (known after apply)
+       onpremises_sam_account_name    = (known after apply)
+       onpremises_security_identifier = (known after apply)
+       onpremises_sync_enabled        = (known after apply)
+       owners                         = (known after apply)
+       preferred_language             = (known after apply)
+       prevent_duplicate_names        = false
+       proxy_addresses                = (known after apply)
+       security_enabled               = true
+       types                          = [
+           "DynamicMembership",
        ]
+       visibility                     = (known after apply)

+       dynamic_membership {
+           enabled = true
+           rule    = "user.userPrincipalName -contains "jennasrunbooks""
        }
    }

  # azuread_user.Bob_Ross will be created
+   resource "azuread_user" "Bob_Ross" {
+       about_me                       = (known after apply)
+       account_enabled                = true
+       business_phones                = (known after apply)
+       creation_type                  = (known after apply)
+       department                     = "Art"
+       disable_password_expiration    = false
+       disable_strong_password        = false
+       display_name                   = "Bob Ross"
+       external_user_state            = (known after apply)
+       force_password_change          = true
+       id                             = (known after apply)
+       im_addresses                   = (known after apply)
+       mail                           = (known after apply)
+       mail_nickname                  = (known after apply)
+       object_id                      = (known after apply)
+       onpremises_distinguished_name  = (known after apply)
+       onpremises_domain_name         = (known after apply)
+       onpremises_immutable_id        = (known after apply)
+       onpremises_sam_account_name    = (known after apply)
+       onpremises_security_identifier = (known after apply)
+       onpremises_sync_enabled        = (known after apply)
+       onpremises_user_principal_name = (known after apply)
+       password                       = (sensitive value)
+       proxy_addresses                = (known after apply)
+       show_in_address_list           = true
+       user_principal_name            = "bobross@jennasrunbooks.com"
+       user_type                      = (known after apply)
    }

  # azuread_user.raybrown will be created
+   resource "azuread_user" "raybrown" {
+       about_me                       = (known after apply)
+       account_enabled                = true
+       business_phones                = (known after apply)
+       creation_type                  = (known after apply)
+       department                     = "Art"
+       disable_password_expiration    = false
+       disable_strong_password        = false
+       display_name                   = "Ray Brown"
+       external_user_state            = (known after apply)
+       force_password_change          = true
+       id                             = (known after apply)
+       im_addresses                   = (known after apply)
+       mail                           = (known after apply)
+       mail_nickname                  = (known after apply)
+       object_id                      = (known after apply)
+       onpremises_distinguished_name  = (known after apply)
+       onpremises_domain_name         = (known after apply)
+       onpremises_immutable_id        = (known after apply)
+       onpremises_sam_account_name    = (known after apply)
+       onpremises_security_identifier = (known after apply)
+       onpremises_sync_enabled        = (known after apply)
+       onpremises_user_principal_name = (known after apply)
+       password                       = (sensitive value)
+       proxy_addresses                = (known after apply)
+       show_in_address_list           = true
+       user_principal_name            = "raybrown@jennasrunbooks.com"
+       user_type                      = (known after apply)
    }

  # azurerm_resource_group.artgroup will be created
+   resource "azurerm_resource_group" "artgroup" {
+       id       = (known after apply)
+       location = "eastus2"
+       name     = "artgroup"
    }

  # azurerm_role_assignment.Contributor_role_art will be created
+   resource "azurerm_role_assignment" "Contributor_role_art" {
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = (known after apply)
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "Contributor"
+       scope                            = (known after apply)
+       skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.Reader_role_all will be created
+   resource "azurerm_role_assignment" "Reader_role_all" {
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = (known after apply)
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "Reader"
+       scope                            = "/subscriptions/6dc72639-d492-485d-a969-ee8b027ea83d"
+       skip_service_principal_aad_check = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # data.azurerm_resource_group.artgroup will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "azurerm_resource_group" "artgroup" {%0A      + id       = (known after apply)%0A      + location = (known after apply)%0A      + name     = "artgroup"%0A      + tags     = (known after apply)%0A    }%0A%0A  # azuread_conditional_access_policy.Art_access_policy will be created%0A  + resource "azuread_conditional_access_policy" "Art_access_policy" {%0A      + display_name = "Art policy"%0A      + id           = (known after apply)%0A      + state        = "enabled"%0A%0A      + conditions {%0A          + client_app_types = [%0A              + "all",%0A            ]%0A%0A          + applications {%0A              + excluded_applications = []%0A              + included_applications = [%0A                  + "All",%0A                ]%0A            }%0A%0A          + users {%0A              + included_groups = (known after apply)%0A            }%0A        }%0A%0A      + grant_controls {%0A          + built_in_controls = [%0A              + "mfa",%0A            ]%0A          + operator          = "OR"%0A        }%0A    }%0A%0A  # azuread_group.Art will be created%0A  + resource "azuread_group" "Art" {%0A      + auto_subscribe_new_members     = (known after apply)%0A      + display_name                   = "Art"%0A      + external_senders_allowed       = (known after apply)%0A      + hide_from_address_lists        = (known after apply)%0A      + hide_from_outlook_clients      = (known after apply)%0A      + id                             = (known after apply)%0A      + mail                           = (known after apply)%0A      + mail_nickname                  = (known after apply)%0A      + members                        = (known after apply)%0A      + object_id                      = (known after apply)%0A      + onpremises_domain_name         = (known after apply)%0A      + onpremises_netbios_name        = (known after apply)%0A      + onpremises_sam_account_name    = (known after apply)%0A      + onpremises_security_identifier = (known after apply)%0A      + onpremises_sync_enabled        = (known after apply)%0A      + owners                         = (known after apply)%0A      + preferred_language             = (known after apply)%0A      + prevent_duplicate_names        = false%0A      + proxy_addresses                = (known after apply)%0A      + security_enabled               = true%0A      + types                          = [%0A          + "DynamicMembership",%0A        ]%0A      + visibility                     = (known after apply)%0A%0A      + dynamic_membership {%0A          + enabled = true%0A          + rule    = "user.department -eq "Art""%0A        }%0A    }%0A%0A  # azuread_group.Engineering will be created%0A  + resource "azuread_group" "Engineering" {%0A      + auto_subscribe_new_members     = (known after apply)%0A      + display_name                   = "Engineering"%0A      + external_senders_allowed       = (known after apply)%0A      + hide_from_address_lists        = (known after apply)%0A      + hide_from_outlook_clients      = (known after apply)%0A      + id                             = (known after apply)%0A      + mail                           = (known after apply)%0A      + mail_nickname                  = (known after apply)%0A      + members                        = (known after apply)%0A      + object_id                      = (known after apply)%0A      + onpremises_domain_name         = (known after apply)%0A      + onpremises_netbios_name        = (known after apply)%0A      + onpremises_sam_account_name    = (known after apply)%0A      + onpremises_security_identifier = (known after apply)%0A      + onpremises_sync_enabled        = (known after apply)%0A      + owners                         = (known after apply)%0A      + preferred_language             = (known after apply)%0A      + prevent_duplicate_names        = false%0A      + proxy_addresses                = (known after apply)%0A      + security_enabled               = true%0A      + types                          = [%0A          + "DynamicMembership",%0A        ]%0A      + visibility                     = (known after apply)%0A%0A      + dynamic_membership {%0A          + enabled = true%0A          + rule    = "user.department -eq "Engineering""%0A        }%0A    }%0A%0A  # azuread_group.Readers will be created%0A  + resource "azuread_group" "Readers" {%0A      + auto_subscribe_new_members     = (known after apply)%0A      + display_name                   = "Readers"%0A      + external_senders_allowed       = (known after apply)%0A      + hide_from_address_lists        = (known after apply)%0A      + hide_from_outlook_clients      = (known after apply)%0A      + id                             = (known after apply)%0A      + mail                           = (known after apply)%0A      + mail_nickname                  = (known after apply)%0A      + members                        = (known after apply)%0A      + object_id                      = (known after apply)%0A      + onpremises_domain_name         = (known after apply)%0A      + onpremises_netbios_name        = (known after apply)%0A      + onpremises_sam_account_name    = (known after apply)%0A      + onpremises_security_identifier = (known after apply)%0A      + onpremises_sync_enabled        = (known after apply)%0A      + owners                         = (known after apply)%0A      + preferred_language             = (known after apply)%0A      + prevent_duplicate_names        = false%0A      + proxy_addresses                = (known after apply)%0A      + security_enabled               = true%0A      + types                          = [%0A          + "DynamicMembership",%0A        ]%0A      + visibility                     = (known after apply)%0A%0A      + dynamic_membership {%0A          + enabled = true%0A          + rule    = "user.userPrincipalName -contains "jennasrunbooks""%0A        }%0A    }%0A%0A  # azuread_user.Bob_Ross will be created%0A  + resource "azuread_user" "Bob_Ross" {%0A      + about_me                       = (known after apply)%0A      + account_enabled                = true%0A      + business_phones                = (known after apply)%0A      + creation_type                  = (known after apply)%0A      + department                     = "Art"%0A      + disable_password_expiration    = false%0A      + disable_strong_password        = false%0A      + display_name                   = "Bob Ross"%0A      + external_user_state            = (known after apply)%0A      + force_password_change          = true%0A      + id                             = (known after apply)%0A      + im_addresses                   = (known after apply)%0A      + mail                           = (known after apply)%0A      + mail_nickname                  = (known after apply)%0A      + object_id                      = (known after apply)%0A      + onpremises_distinguished_name  = (known after apply)%0A      + onpremises_domain_name         = (known after apply)%0A      + onpremises_immutable_id        = (known after apply)%0A      + onpremises_sam_account_name    = (known after apply)%0A      + onpremises_security_identifier = (known after apply)%0A      + onpremises_sync_enabled        = (known after apply)%0A      + onpremises_user_principal_name = (known after apply)%0A      + password                       = (sensitive value)%0A      + proxy_addresses                = (known after apply)%0A      + show_in_address_list           = true%0A      + user_principal_name            = "bobross@jennasrunbooks.com"%0A      + user_type                      = (known after apply)%0A    }%0A%0A  # azuread_user.raybrown will be created%0A  + resource "azuread_user" "raybrown" {%0A      + about_me                       = (known after apply)%0A      + account_enabled                = true%0A      + business_phones                = (known after apply)%0A      + creation_type                  = (known after apply)%0A      + department                     = "Art"%0A      + disable_password_expiration    = false%0A      + disable_strong_password        = false%0A      + display_name                   = "Ray Brown"%0A      + external_user_state            = (known after apply)%0A      + force_password_change          = true%0A      + id                             = (known after apply)%0A      + im_addresses                   = (known after apply)%0A      + mail                           = (known after apply)%0A      + mail_nickname                  = (known after apply)%0A      + object_id                      = (known after apply)%0A      + onpremises_distinguished_name  = (known after apply)%0A      + onpremises_domain_name         = (known after apply)%0A      + onpremises_immutable_id        = (known after apply)%0A      + onpremises_sam_account_name    = (known after apply)%0A      + onpremises_security_identifier = (known after apply)%0A      + onpremises_sync_enabled        = (known after apply)%0A      + onpremises_user_principal_name = (known after apply)%0A      + password                       = (sensitive value)%0A      + proxy_addresses                = (known after apply)%0A      + show_in_address_list           = true%0A      + user_principal_name            = "raybrown@jennasrunbooks.com"%0A      + user_type                      = (known after apply)%0A    }%0A%0A  # azurerm_resource_group.artgroup will be created%0A  + resource "azurerm_resource_group" "artgroup" {%0A      + id       = (known after apply)%0A      + location = "eastus2"%0A      + name     = "artgroup"%0A    }%0A%0A  # azurerm_role_assignment.Contributor_role_art will be created%0A  + resource "azurerm_role_assignment" "Contributor_role_art" {%0A      + id                               = (known after apply)%0A      + name                             = (known after apply)%0A      + principal_id                     = (known after apply)%0A      + principal_type                   = (known after apply)%0A      + role_definition_id               = (known after apply)%0A      + role_definition_name             = "Contributor"%0A      + scope                            = (known after apply)%0A      + skip_service_principal_aad_check = (known after apply)%0A    }%0A%0A  # azurerm_role_assignment.Reader_role_all will be created%0A  + resource "azurerm_role_assignment" "Reader_role_all" {%0A      + id                               = (known after apply)%0A      + name                             = (known after apply)%0A      + principal_id                     = (known after apply)%0A      + principal_type                   = (known after apply)%0A      + role_definition_id               = (known after apply)%0A      + role_definition_name             = "Reader"%0A      + scope                            = "/subscriptions/6dc72639-d492-485d-a969-ee8b027ea83d"%0A      + skip_service_principal_aad_check = (known after apply)%0A    }%0A%0APlan: 9 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # data.azurerm_resource_group.artgroup will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "azurerm_resource_group" "artgroup" {%0A      + id       = (known after apply)%0A      + location = (known after apply)%0A      + name     = "artgroup"%0A      + tags     = (known after apply)%0A    }%0A%0A  # azuread_conditional_access_policy.Art_access_policy will be created%0A  + resource "azuread_conditional_access_policy" "Art_access_policy" {%0A      + display_name = "Art policy"%0A      + id           = (known after apply)%0A      + state        = "enabled"%0A%0A      + conditions {%0A          + client_app_types = [%0A              + "all",%0A            ]%0A%0A          + applications {%0A              + excluded_applications = []%0A              + included_applications = [%0A                  + "All",%0A                ]%0A            }%0A%0A          + users {%0A              + included_groups = (known after apply)%0A            }%0A        }%0A%0A      + grant_controls {%0A          + built_in_controls = [%0A              + "mfa",%0A            ]%0A          + operator          = "OR"%0A        }%0A    }%0A%0A  # azuread_group.Art will be created%0A  + resource "azuread_group" "Art" {%0A      + auto_subscribe_new_members     = (known after apply)%0A      + display_name                   = "Art"%0A      + external_senders_allowed       = (known after apply)%0A      + hide_from_address_lists        = (known after apply)%0A      + hide_from_outlook_clients      = (known after apply)%0A      + id                             = (known after apply)%0A      + mail                           = (known after apply)%0A      + mail_nickname                  = (known after apply)%0A      + members                        = (known after apply)%0A      + object_id                      = (known after apply)%0A      + onpremises_domain_name         = (known after apply)%0A      + onpremises_netbios_name        = (known after apply)%0A      + onpremises_sam_account_name    = (known after apply)%0A      + onpremises_security_identifier = (known after apply)%0A      + onpremises_sync_enabled        = (known after apply)%0A      + owners                         = (known after apply)%0A      + preferred_language             = (known after apply)%0A      + prevent_duplicate_names        = false%0A      + proxy_addresses                = (known after apply)%0A      + security_enabled               = true%0A      + types                          = [%0A          + "DynamicMembership",%0A        ]%0A      + visibility                     = (known after apply)%0A%0A      + dynamic_membership {%0A          + enabled = true%0A          + rule    = "user.department -eq "Art""%0A        }%0A    }%0A%0A  # azuread_group.Engineering will be created%0A  + resource "azuread_group" "Engineering" {%0A      + auto_subscribe_new_members     = (known after apply)%0A      + display_name                   = "Engineering"%0A      + external_senders_allowed       = (known after apply)%0A      + hide_from_address_lists        = (known after apply)%0A      + hide_from_outlook_clients      = (known after apply)%0A      + id                             = (known after apply)%0A      + mail                           = (known after apply)%0A      + mail_nickname                  = (known after apply)%0A      + members                        = (known after apply)%0A      + object_id                      = (known after apply)%0A      + onpremises_domain_name         = (known after apply)%0A      + onpremises_netbios_name        = (known after apply)%0A      + onpremises_sam_account_name    = (known after apply)%0A      + onpremises_security_identifier = (known after apply)%0A      + onpremises_sync_enabled        = (known after apply)%0A      + owners                         = (known after apply)%0A      + preferred_language             = (known after apply)%0A      + prevent_duplicate_names        = false%0A      + proxy_addresses                = (known after apply)%0A      + security_enabled               = true%0A      + types                          = [%0A          + "DynamicMembership",%0A        ]%0A      + visibility                     = (known after apply)%0A%0A      + dynamic_membership {%0A          + enabled = true%0A          + rule    = "user.department -eq "Engineering""%0A        }%0A    }%0A%0A  # azuread_group.Readers will be created%0A  + resource "azuread_group" "Readers" {%0A      + auto_subscribe_new_members     = (known after apply)%0A      + display_name                   = "Readers"%0A      + external_senders_allowed       = (known after apply)%0A      + hide_from_address_lists        = (known after apply)%0A      + hide_from_outlook_clients      = (known after apply)%0A      + id                             = (known after apply)%0A      + mail                           = (known after apply)%0A      + mail_nickname                  = (known after apply)%0A      + members                        = (known after apply)%0A      + object_id                      = (known after apply)%0A      + onpremises_domain_name         = (known after apply)%0A      + onpremises_netbios_name        = (known after apply)%0A      + onpremises_sam_account_name    = (known after apply)%0A      + onpremises_security_identifier = (known after apply)%0A      + onpremises_sync_enabled        = (known after apply)%0A      + owners                         = (known after apply)%0A      + preferred_language             = (known after apply)%0A      + prevent_duplicate_names        = false%0A      + proxy_addresses                = (known after apply)%0A      + security_enabled               = true%0A      + types                          = [%0A          + "DynamicMembership",%0A        ]%0A      + visibility                     = (known after apply)%0A%0A      + dynamic_membership {%0A          + enabled = true%0A          + rule    = "user.userPrincipalName -contains "jennasrunbooks""%0A        }%0A    }%0A%0A  # azuread_user.Bob_Ross will be created%0A  + resource "azuread_user" "Bob_Ross" {%0A      + about_me                       = (known after apply)%0A      + account_enabled                = true%0A      + business_phones                = (known after apply)%0A      + creation_type                  = (known after apply)%0A      + department                     = "Art"%0A      + disable_password_expiration    = false%0A      + disable_strong_password        = false%0A      + display_name                   = "Bob Ross"%0A      + external_user_state            = (known after apply)%0A      + force_password_change          = true%0A      + id                             = (known after apply)%0A      + im_addresses                   = (known after apply)%0A      + mail                           = (known after apply)%0A      + mail_nickname                  = (known after apply)%0A      + object_id                      = (known after apply)%0A      + onpremises_distinguished_name  = (known after apply)%0A      + onpremises_domain_name         = (known after apply)%0A      + onpremises_immutable_id        = (known after apply)%0A      + onpremises_sam_account_name    = (known after apply)%0A      + onpremises_security_identifier = (known after apply)%0A      + onpremises_sync_enabled        = (known after apply)%0A      + onpremises_user_principal_name = (known after apply)%0A      + password                       = (sensitive value)%0A      + proxy_addresses                = (known after apply)%0A      + show_in_address_list           = true%0A      + user_principal_name            = "bobross@jennasrunbooks.com"%0A      + user_type                      = (known after apply)%0A    }%0A%0A  # azuread_user.raybrown will be created%0A  + resource "azuread_user" "raybrown" {%0A      + about_me                       = (known after apply)%0A      + account_enabled                = true%0A      + business_phones                = (known after apply)%0A      + creation_type                  = (known after apply)%0A      + department                     = "Art"%0A      + disable_password_expiration    = false%0A      + disable_strong_password        = false%0A      + display_name                   = "Ray Brown"%0A      + external_user_state            = (known after apply)%0A      + force_password_change          = true%0A      + id                             = (known after apply)%0A      + im_addresses                   = (known after apply)%0A      + mail                           = (known after apply)%0A      + mail_nickname                  = (known after apply)%0A      + object_id                      = (known after apply)%0A      + onpremises_distinguished_name  = (known after apply)%0A      + onpremises_domain_name         = (known after apply)%0A      + onpremises_immutable_id        = (known after apply)%0A      + onpremises_sam_account_name    = (known after apply)%0A      + onpremises_security_identifier = (known after apply)%0A      + onpremises_sync_enabled        = (known after apply)%0A      + onpremises_user_principal_name = (known after apply)%0A      + password                       = (sensitive value)%0A      + proxy_addresses                = (known after apply)%0A      + show_in_address_list           = true%0A      + user_principal_name            = "raybrown@jennasrunbooks.com"%0A      + user_type                      = (known after apply)%0A    }%0A%0A  # azurerm_resource_group.artgroup will be created%0A  + resource "azurerm_resource_group" "artgroup" {%0A      + id       = (known after apply)%0A      + location = "eastus2"%0A      + name     = "artgroup"%0A    }%0A%0A  # azurerm_role_assignment.Contributor_role_art will be created%0A  + resource "azurerm_role_assignment" "Contributor_role_art" {%0A      + id                               = (known after apply)%0A      + name                             = (known after apply)%0A      + principal_id                     = (known after apply)%0A      + principal_type                   = (known after apply)%0A      + role_definition_id               = (known after apply)%0A      + role_definition_name             = "Contributor"%0A      + scope                            = (known after apply)%0A      + skip_service_principal_aad_check = (known after apply)%0A    }%0A%0A  # azurerm_role_assignment.Reader_role_all will be created%0A  + resource "azurerm_role_assignment" "Reader_role_all" {%0A      + id                               = (known after apply)%0A      + name                             = (known after apply)%0A      + principal_id                     = (known after apply)%0A      + principal_type                   = (known after apply)%0A      + role_definition_id               = (known after apply)%0A      + role_definition_name             = "Reader"%0A      + scope                            = "/subscriptions/6dc72639-d492-485d-a969-ee8b027ea83d"%0A      + skip_service_principal_aad_check = (known after apply)%0A    }%0A%0APlan: 9 to add, 0 to change, 0 to destroy.%0A

::set-output name=stderr::

::set-output name=exitcode::0
```

</details>

*Pushed by: @jksprattler, Action: `pull_request`*